package common;

import java.util.Scanner;

public enum HomeMenu {
		
	HOME(-1, "\n🥄4.로그인🥄 🥄2.회원가입🥄 🥄10.전체 메뉴 보기🥄 🥄13.리뷰조회🥄 🥄0.프로그램 종료🥄\n\n🍽이동할 메뉴를 선택하세요🍽: "),
    QUIT(0, "\n================================▶쩝쩝박사◀================================\n                                                         ∧ ∧"
    		+ "\n                             프로그램을 종료합니다💨          ( ´･ω･)　배불러"
    		+ "\n                            이용해주셔서 감사합니다👍          /　　⌒ヽ"
    		+ "\n                                                       （人＿__つ_つ"
    		+ "\n======================================================================="),
    MAIN(1, "🥄3.음식 주문🥄 🥄7.주문내역🥄 🥄13.리뷰조회🥄 🥄14.리뷰작성🥄 🥄77.게임🥄 🥄9.로그아웃🥄 🥄0.프로그램 종료🥄 \n\n🍽이동할 메뉴를 선택하세요🍽: "), //로그인하면 나오는 회원탭
    JOIN(2, "\n============================================================================\n\n🤞회원가입에 필요한 정보를 입력합니다🤞\n\n"),
    CATE(3, "\n============================================================================\n\t▷87.한식🍙◁     ▷88.양식🍕◁     ▷89.일식🍣◁     ▷90.랜덤메뉴주문🍄 ◁ \n\n                       - 카테고리 번호를 입력해주세요 -               [1.뒤로가기]  \n============================================================================\n"),
    INSERT_ORDER(80, "- 주문할 음식 번호를 입력해주세요 🍱  -                                 [1.뒤로가기]\n============================================================================\n"),
    LOGIN(4, "\n============================================================================\n👋아이디와 비밀번호를 입력하세요.👋\n"),
    LOGOUT(9, "💤로그아웃 되었습니다!💤\n"),
    REVIEW_LIST(13, "\n============================================================================\n <💌전체 리뷰💌>\n"), //리뷰조회
    REVIEW_INSERT(14, "\n============================================================================\n\n고객님의 소중한 한줄 리뷰를 작성해주세요😁😁 콜라는 서비스🥤 \n"), // 리뷰작성
    REVIEW_DLEETE(72, "\n============================================================================\n✂리뷰삭제메뉴✂\n\n<💌전체 리뷰💌>\n"), // 리뷰삭제
    FOOD_LIST(10, "\n============================================================================\n\n🍝🍝전체 음식 목록🍝🍝\n\n"),
	FOOD_KR(87, "\n============================================================================\n  🥄한식🍙🥄\n\n"),
	FOOD_US(88, "\n============================================================================\n  🥄양식🍕🥄\n\n"),
	FOOD_JP(89, "\n============================================================================\n  🥄일식🍣🥄\n\n"),
	GETORDER(7,"\n============================================================================\n🍪나의주문내역확인🍪\n\n"),
	MODIFY_STATE(70,"\n=====================================================================================\n배달상태변경\n\n"),
	GETORDER_ALL(71,"\n==================================================================================\n🍜전체 주문 내역 확인🍜\n\n"),
	FIND_CUSTOMER(99,"\n======================================================================================================\n👨‍🎓전체회원조회👨‍🎓\n\n"),
	MANAGER(9999,"\n[관리자창]\n\n🥢70.배달관리🥢 🥢71.전체주문내역확인🥢 🥢72.리뷰삭제🥢 🥢99.전체고객조회🥢 🥢9.로그아웃🥢 🥢0.프로그램 종료🥢\n "),
	GAME(77,"\n🥄56.GBB게임🥄  🥄57.랜덤잭팟🥄              [1.뒤로가기] "),
	GGAME(56,"\n"),
	RGAME(57,"\n"),
	RANDOM_MENU(90,"\n============================================================================\n");
	
    private final int menu;
    private final String menuString;
    
    
    HomeMenu(int menu, String menuString) {
        this.menu = menu;
        this.menuString = menuString;
    }

    public int getMenu() {
        return menu;
    }

    public String getMenuString() {
        return menuString;
    }

    public static HomeMenu findMenu(int number) throws MenuNotFoundException {
        for (HomeMenu menu: values()) {
            if (menu.getMenu() == number) {
                return menu;
            }
        }
        throw new MenuNotFoundException("선택하신 메뉴가 없습니다.");
    }
    public void display(Scanner scanner) {

    }
}
